Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གང་ལ་སྙོམས་པར་འཇུག་པ་ན་སེམས་ཅན་ལ་ལྟ་བའི་སྙིང་རྗེ་ཆེན་པོས་དམིགས་པའི་སེམས་ཉེ་བར་འབྲེལ་པར་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། ཞི་བ་དང་རབ་ཏུ་ཞི་བ་ལ་སྙོམས་པར་འཇུག་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་སྒྲུབ་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་ཆོས་གང་ལ་ཡང་ཉེ་བར་འབྲེལ་པར་མི་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་ཆོས་ཐམས་ཅད་འཛིན་པ་ལ་ལྟོས་པ་དེ་ནི་དེའི་ཐབས་སོ། ། གང་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པས་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སངས་རྒྱས་ཀྱི་སྐུའི་རྒྱན་མངོན་དུ་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་ཆོས་ཀྱི་སྐུ་ལ་གནས་ནས་ བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སངས་རྒྱས་ཀྱི་གསུང་དང་། དབྱངས་དང་། སྒྲ་དང་། ཚངས་པའི་དབྱངས་ལ་སེམས་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་བརྗོད་དུ་མེད་པའི་ཆོས་ཉིད་ཀྱིས་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སེམས་རྡོ་རྗེ་ལྟ་བུར་བྱིན་གྱིས་རློབ་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་དྲན་པ་མི་གཡེང་བས་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སྔོན་གྱི་སྨོན་ལམ་གྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་བྱིན་གྱིས་རློབ་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་སེམས་ཅན་ཐམས་ཅད་བདག་མེད་པར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །
en: “While in this state, out of concern for sentient beings, he directs his mind to the object of his great compassion. This is his skillful means. He enters into a state of peace, a state of calm. This is his wisdom. While in this state, he masters buddha knowledge. This is his skillful means. He does not bind himself to any phenomena. This is his wisdom. While in this state, he relies on the acceptance of all phenomena. This is his skillful means. He meditates from the perspective of the uncontaminated nature of the totality of phenomena. This is his wisdom. While in this state, he manifests the ornament of the buddha body. This is his skillful means. He meditates from the perspective of the state of the Dharma body. This is his wisdom. He pays attention to the sounds, the words, the speech of the buddhas, who speak with the voice of Brahmā. This is his skillful means. He meditates from the perspective of the ineffability of phenomena. This is his wisdom. While in this state, he remains present in the vajra-like state of mind. This is his skillful means. He meditates with unscattered mindfulness. This is his wisdom. While in this state, he bases himself on his vow to bring sentient beings to maturity. This is his skillful means. He meditates from the perspective of the fact that all sentient beings lack a self. This is his wisdom.

source: གང་བསམ་གཏན་བྱེད་པ་ན་དགེ་བའི་རྩ་བ་རྣམས་ལྷག་པར་དམིགས་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་རྩ་བ་མེད་པ་དང་། གནས་མེད་པར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་མངོན་དུ་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་ཞིང་ནམ་མཁའ་དང་མཉམ་པར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་བཀོད་པ་མངོན་དུ་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་ཉོན་མོངས་པ་ཉེ་བར་ཞི་བར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །གང་སྙོམས་པར་འཇུག་པ་ན་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་ལ་དམིགས་པར་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། གང་བསྐོར་བ་ཡང་མེད། ལྡོག་པ་ཡང་མེད་པར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་བོ། །བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་ཇི་སྙེད་པ་དེ་ལ་སྙོམས་པར་འཇུག་པ་ན་བཏང་སྙོམས་སུ་བྱེད་པ་དང་། མངོན་དུ་བྱེད་པ་འདི་ནི་དེའི་ཐབས་སོ། ། ཉེ་བའི་ཉོན་མོངས་པ་ཇི་སྙེད་པ་ཡོངས་སུ་གདུང་བ་མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་། བསམ་གཏན་གྱི་བདེ་བ་ཆོས་ཐམས་ཅད་དང་མི་ལྡན་པ་དང་། འདུ་ཤེས་ཆགས་པ་མེད་པ་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པ་དང་། འདུ་ཤེས་ཐམས་ཅད་སེལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ངེས་པར་གྱུར་པ་དེ་ལ་བསམ་གཏན་དང་བསམ་གཏན་མེད་པར་བསམ་གཏན་བྱེད་པ་འདི་ནི་དེའི་ཤེས་རབ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་བུར་ཞུགས་པ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཟད་མི་ཤེས་པ་ཡིན་ནོ། ། བདུད་ཐམས་ཅད་ཀྱིས་ཀྱང་གླགས་མི་རྙེད་དོ། ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྣོད་དུ་ཉེ་བར་གནས་པ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་འདི་ནི་ཐབས། འདི་ནི་ཤེས་རབ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་དང་ཤེས་རབ་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: He attains the roots of virtue that come from meditation. This is his skillful means. He meditates by not basing himself on roots. This is his wisdom. While in this state, he manifests the complete purity of a buddha field. This is his skillful means. He meditates on the sky-like buddha fields. This is his wisdom. While in this state, he manifests an array of ornaments to the essence of awakening. This is his skillful means. He meditates from the perspective of the pacification of the vices. This is his wisdom. While in this state, he makes the setting in motion of the wheel of the Dharma his aim. This is his skillful means. He meditates from the perspective of the fact that nothing is set in motion and no motion is obstructed. This is his wisdom. While in this state, he looks upon the factors of awakening and manifests them to the extent to which they have been cultivated. This is his skillful means. He meditates by way of meditation and nonmeditation, seeing that as many secondary vices as there may be, they are free from all things related to the happiness beyond burning desire, the wisdom and concentration of the Tathāgata; they are complete knowledge that is unattached to perception and nonperception; they are the removal of all kinds of perceptions; and they conform to the destiny of all bodhisatvas. This is his wisdom. This is what the imperishable perfection of meditation of bodhisatvas, great beings, who practice in this way is like. No māras are able to obstruct them, and they tend to the vessel of the qualities of all the buddhas. This, Śāriputra, is what his skillful means are like, and this is what his wisdom is like. This is the perfection of meditation of bodhisatvas, which leads to wisdom and skillful means.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་ཤེས་པ་ལས་ཉམས་པ་མེད་པར་འདུ་ཤེས་སུ་གྱུར་པའི་ལས་རྣམས་ཀྱང་བྱེད་དོ། ། མངོན་པར་ཤེས་པས་ཀྱང་རྣམ་པར་རོལ་ལ་བྱ་བ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ། ། མངོན་པར་ཤེས་པ་ལ་རབ་ཏུ་གནས་ལ་འཇུག་པ་ཆེན་པོ་ལ་ཡང་འཛུད་པར་བྱེད་དོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་བྱེད་པའོ། ། འཇིག་རྟེན་ལས་འདས་པའོ། ། ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའོ། ། བྱ་བ་ཐམས་ཅད་ལ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཤེས་རབ་བྱེད་པའོ། ། འཇིག་རྟེན་གྱི་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་མངོན་སུམ་དུ་གྱུར་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཟད་པའི་རྣམ་པའོ། ། ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པའོ། ། ནམ་མཁའ་དང་མཚུངས་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་གཟུགས་དང་གཟུགས་མེད་པ་རྣམས་སུ་གཟུགས་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་སྔོན་གྱི་མཐའི་སྒྲ་དང་མཉམ་པ་ཉིད་ཀྱིས་སྒྲ་ཐམས་ཅད་རྗེས་སུ་སོང་བའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་རང་བཞིན་དག་མངོན་སུམ་དུ་མཐོང་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་བའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་གཅོད་པས་བསྐལ་པ་ཐམས་ཅད་རྗེས་སུ་དྲན་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ཀུན་སྟོན་ཅིང་གཞན་ལ་མངོན་དུ་ཕྱོགས་པ་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་དུས་ལས་མི་འདའ་བས་དུས་ལ་སྡོད་པའི་ཕྱིར་ཟག་པ་ཟད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་སོང་བའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་འཕགས་པའོ། ། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ལ་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གཏིང་དཔག་དཀའ་བའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཟབ་མོའི་དོན་ཏོ། ། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་འཛིན་པའོ། ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་གཞོལ་བའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་འཐུན་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་འདུལ་བར་བྱེད་པའོ། ། དེའི་མངོན་པར་ཤེས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ལ་དབང་བས་དབང་བསྐུར་བ་ཐོབ་པའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་མ་ཉམས་པ་ནི་ཤེས་པས་བྱས་པའི་ལས་རྣམས་བྱེད་ཀྱི་ང་རྒྱལ་གྱིས་བྱས་པ་ནི་མ་ཡིན་ནོ། །
en: “Moreover, Śāriputra, the superior abilities of the bodhisatva, the great being, are imperishable. He performs actions with knowledge. He displays all actions as a play of his superior abilities. Well established in his superior abilities, he brings about great events. His superior abilities produce knowledge and they are transcendental, conducive to insight, and furnished with all excellent qualities. His superior abilities produce knowledge and are directly experienced in both worldly and transcendental phenomena. His superior abilities have an indestructible form, and they conform to every situation, like space. With his superior abilities, he is able to reveal all forms in the realm of form and in the formless realm. With his superior abilities, he is able to follow all sounds because of the sameness of all voices in the past. With his superior abilities, he is able to view the mental activity of all sentient beings because he can see and discern their essential nature. With his superior abilities, he is able to recollect all eons because he is able to perceive the past and the future. With his superior abilities, he is able to display transformations that are characterized by being creations that appear for others. With his superior abilities he is attuned to the knowledge of the disappearance of defilements, because he takes account of the occasion and does not act inappropriately in any given situation. His superior abilities are transcendental and lead to insight into all phenomena. His superior abilities cannot easily be fathomed by śrāvakas and pratyekabuddhas. His superior abilities have a profound purpose. They are the enemies of Māra, and they destroy him. His superior abilities retain the essence of awakening and are entrusted to the realization of all the qualities of a buddha. His superior abilities help to set the wheel of the Dharma in motion. With his superior abilities, he trains all sentient beings. His superior abilities are like a coronation, as he attains power over all phenomena. In this way, Śāriputra, the bodhisatva performs actions with knowledge, and not with pride.

source: མངོན་པར་ཤེས་པ་མ་ཉམས་པ་དེ་སེམས་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་བྱང་བ་དང་། འོད་གསལ་བ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་དང་། ཤིན་ཏུ་དུལ་བ་དང་། ཤིན་ཏུ་ཞི་བ་དང་། ཤིན་ཏུ་སྦྱང་བ་བྱས་པ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པས་ཀྱང་བསམས་བཞིན་དུ་སྐྱེ་སྟེ བཅིངས་བཞིན་དུ་སྐྱེ་བ་མ་ཡིན། བཅིངས་བཞིན་དུ་འཆི་འཕོ་བ་མ་ཡིན། བཅིངས་བཞིན་དུ་འབྱུང་བ་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཡང་དག་པར་མ་ཡིན་པ་ཀུན་རྟོག་པ་ལས་གྲོལ་བའོ། ། དེ་ནི་ཉོན་མོངས་པའི་བཅིངས་པ་ཐམས་ཅད་ལས་གྲོལ་བའོ། ། དེ་ནི་ཕྱིན་ཅི་ལོག་གི་རྩེ་མོའི་གནས་ལས་གྲོལ་བའོ། ། དེ་བས་ན་དེ་གྲོལ་བཞིན་དུ་སྐྱེ། གྲོལ་བཞིན་དུ་འཆི་འཕོ། གྲོལ་བཞིན་དུ་འབྱུང་ངོ་། ། དེ་སྐྱེ་ཡང་ཐེག་པ་ཆེན་པོས་ཕོངས་པར་ཡང་མི་འགྱུར་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །
en: “Having cultivated imperishable superior abilities with a mind that is completely pure, completely clear, cleansed, spotless, free from the secondary vices, well disciplined, completely calm, and well prepared, a mind that has attained meditation, liberation, and concentration, he intentionally takes birth but is not bound by birth, is not bound by death, and is not bound by rebirth. Why is this? It is because he is liberated from making false assumptions, liberated from being bound by all the vices, liberated from relying on any wrong views. Therefore, he is liberated in birth, liberated in death, and liberated in rebirth. When he is reborn, he does not stray from the Mahāyāna but perfects the qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ཀྱང་ཕྱོགས་བཅུ་ཀུན་ཏུ་བཙལ་ཀྱང་མི་རྙེད། མི་དམིགས་ལ་ཆོས་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རྗེས་སུ་འཇུག་གོ ། དེ་ལྟར་ན་རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱང་མ་ཡིན་ལ་ཆོས་མ་ཡིན་པ་ཡང་མ་ཡིན་པ་ཞེས་བྱའོ། ། ཆོས་གང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཀུན་ཏུ་བཙལ་ཀྱང་མི་རྙེད་པ་དེ་ལ་བགྲང་བ་གང་ཡང་མེད་དེ། ཆོས་ཐམས་ཅད་ནི་བགྲང་བའི་ལམ་ལས་ཤིན་ཏུ་འདས་པའོ། ། གང་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དེ་ནི་ཆོས་དང་ཆོས་མ་ཡིན་པ་ལ་མངོན་པར་ཆགས་པར་མི་བྱེད་དོ། ། མངོན་པར་ཆགས་པ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དོན་ཏོ། ། གང་དོན་ལ་རློམ་སེམས་སུ་བྱེད་པ་དེ་ནི་དེའི་གནོད་པ་ཆེན་པོའོ། ། གང་དོན་ལ་རློམ་སེམས་སུ་མི་བྱེད་པ་དེའི་མདུན་ན་ནི་དོན་ནམ་དོན་མ་ཡིན་པ་མི་གནས་སོ། ། དོན་མཐོང་བ་ལས་གང་དུ་ཡང་བློ་ཐོགས་པར་མི་འགྱུར་ཏེ། དེའི་བློ་ཐོགས་པ་མེད་དོ། ། གང་བློ་ཐོགས་པ་མེད་པ་དེ་ཡོངས་སུ་མི་འཛིན་ཏོ། ། གང་ཡོངས་སུ་མི་འཛིན་པ་དེ་མི་ཆགས་སོ། ། གང་མི་ཆགས་པ་དེ་གནས་མེད་དོ། ། གང་གནས་མེད་པ་དེ་ཉམས་པ་མེད་དོ། ། གང་ཉམས་པ་མེད་པ་དེའི་རྩོལ་བ་འབྲས་བུ་ཡོད་པའོ། ། གང་རྩོལ་བ་འབྲས་བུ་ཡོད་པ་དེ་ལ་གཏི་མུག་མེད་དོ། ། གང་གཏི་མུག་མེད་པ་དེ་ལ་ངའི་བ་མེད་དོ། ། གང་ལ་ངའི་བ་མེད་པ་དེ་ལ་རྩོད་པ་མེད་དོ། ། གང་རྩོད་པ་མེད་པ་དེ་དགེ་སྦྱོང་གི་ཆོས་རྩོད་པ་མེད་པའོ། ། གང་དགེ་སྦྱོང་གི་ཆོས་རྩོད་པ་མེད་པ་དེ་ལག་པའི་ནམ་མཁའ་དང་མཚུངས་སོ། ། གང་ལག་པའི་ནམ་མཁའ་དང་མཚུངས་པ་དེ་འདོད་པའི་ཁམས་སུ་གཏོགས་པ་མ་ཡིན། གཟུགས་ཀྱི་ཁམས་སུ་གཏོགས་པ་མ་ཡིན། གཟུགས་མེད་པའི་ཁམས་སུ་གཏོགས་པ་མ་ཡིན་ནོ། ། གང་ཐམས་ཅད་དུ་གཏོགས་པ་མ་ཡིན་པ་དེ་ལ་ཁ་དོག་མེད། མཚན་མ་མེད། དབྱིབས་མེད་དོ། ། གང་ཁ་དོག་མེད། མཚན་མ་མེད། དབྱིབས་མེད་པ་དེའི་རྗེས་སུ་རྟགས་པ་ནི་དེ་འདྲའོ། ། དེའི་རྗེས་སུ་རྟོགས་པ་ཅི་འདྲ་བར་རྟོགས་པ་ཡང་དེ་འདྲའོ། ། ཅིའི་ཕྱིར་རྗེས་སུ་རྟོགས་པ་དང་། རྟོགས་པ་ཞེས་བྱ་ཞེ་ན། གང་གི་ཕྱིར་གང་རྗེས་སུ་རྟོགས་པར་བྱ་བ་དང་། རྟོགས་པར་བྱ་བའི་ཆོས་རྡུལ་ཙམ་ཡང་མི་དམིགས་པས་དེའི་ཕྱིར་རྗེས་སུ་རྟོགས་པ་དང་། རྟགས་པ་ཞེས་བྱའོ། ། དེ་ལྟར་རྗེས་སུ་རྟོགས་པ་དང་། རྟོགས་པ་ལ་སྙོམས་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: He obtains the qualities of the buddhas by searching for them in the ten directions, but he does not seize hold of them. He approaches all phenomena as the qualities of the buddhas. In this way, all the buddha-qualities and all phenomena are said to be neither qualities nor nonqualities. The qualities that he truly searches for cannot be obtained, because they are uncountable. The totality of phenomena entirely surpasses any kind of measurement. He knows the sameness of all phenomena, and he is not attached to either qualities or nonqualities. Indeed, his goal is to not be attached to any qualities. If one is conceited about one’s aim, that can be very damaging. But if one is not conceited about one’s goal, it stands before one as neither a goal nor a nongoal. When he sees the aim, his intellect is not hindered in any way. Someone whose intellect is not hindered does not hold on to anything. His intellect is unhindered. Someone who is not hindered does not grasp. Someone who does not grasp is unattached. Someone who is unattached is not stuck. Someone who is not stuck is not faulty. Someone who is not faulty possesses unfailing exertion. Someone who possesses unfailing exertion is not deluded. Someone who is not deluded has no sense of mine. Someone who has no sense of mine does not become involved in disputes. Someone who does not become involved in disputes does not dispute the traditions of other ascetics. Someone who does not dispute the traditions of other ascetics is like someone who holds the whole of space in the palm of his hand. Someone who holds the whole of space in the palm of his hand is not involved with the realm of sensual desire. He is not involved with the realm of form. He is not involved with the formless realm. Someone who is not involved with anything anywhere has no appearance, no gender, and no physical condition. This is what his awakening is like, and his insight is like his awakening. Why are his awakening and his insight said to be like this? There is no phenomenon, not even a phenomenon as small as an atom, that he obtains, that he needs to awaken to, or that he needs to realize. This is why his awakening and his insight are said to be like this. Thus, the bodhisatva, the great being, who has attained awakening and insight is said to possess the wondrous, extraordinary Dharma.

source: བྱང་ཆུབ་སེམས་དཔའི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་གང་ཞེ་ན། གང་བྱམས་པ་དང་། བདག་མེད་པ་ཉིད་དང་། སྙིང་རྗེ་དང་། སེམས་ཅན་མེད་པ་ཉིད་དང་། དགའ་བ་དང་། སྲོག་མེད་པ་ཉིད་དང་། བཏང་སྙོམས་དང་། གང་ཟག་མེད་པ་ཉིད་དང་། སྦྱིན་པ་དང་། སྦྱིན་པའི་སེམས་ཉིད་དང་། ཚུལ་ཁྲིམས་དང་། ཞི་བའི་སེམས་ཉིད་དང་། བཟོད་པ་དང་། མི་ཟད་པའི་སེམས་ཉིད་དང་། བརྩོན་འགྲུས་དང་། དབེན་པའི་སེམས་ཉིད་དང་། བསམ་གཏན་དང་། ངེས་པར་རྟོགས་པའི་སེམས་ཉིད་དང་། ཤེས་རབ་དང་། སྤྲོས་པ་མེད་པའི་སེམས་ཉིད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པའི་སེམས་ཉིད་དང་། ཡང་དག་པར་སྤོང་བ་དང་། སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའི་སེམས་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། སྤྲོས་པ་མེད་པའི་སེམས་ཉིད་དང་། དད་པ་དང་། ཆགས་པ་མེད་པའི་སེམས་ཉིད་དང་། དྲན་པ་དང་། རང་བྱུང་གི་སེམས་ཉིད་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་ཞུགས་པའི་སེམས་ཉིད་དང་། ཤེས་རབ་དང་། དབང་པོ་མེད་པའི་སེམས་ཉིད་དང་། སྟོབས་ཉིད་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བྱང་ཆུབ་རབ་ཏུ་དབྱེ་བ་དང་། ལམ་བསྒོམ་པ་དང་། བསྒོམས་པའི་སེམས་ཉིད་དང་། ཞི་གནས་དང་། ཉེ་བར་ཞི་བའི་སེམས་ཉིད་དང་། ལྷག་མཐོང་དང་། མཐོང་བ་བྲི་བ་མེད་པ་དང་། འཕགས་པའི་བདེན་པ་བསྒོམ་པ་དང་། ཤིན་ཏུ་ཡོངས་སུ་ཤེས་པའི་སེམས་ཉིད་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། ཐོག་མ་ནས་དག་པ་ཉིད་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་སེམས་ཉིད་དང་། མི་སྐྱེ་བ་ལ་བཟོད་པ་དང་། མི་དམིགས་པའི་སེམས་ཉིད་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་དང་། ཕྱིར་མི་ལྡོག་པའི་སེམས་ཉིད་དང་། མཚན་རྙེད་པ་དང་། མཚན་མེད་པའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་དང་ཁམས་གསུམ་གྱི་སྙིང་པོའི་སེམས་ཉིད་དང་། བདུད་ཚར་གཅོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་འདོགས་པའི་སེམས་ཉིད་དང་། བྱང་ཆུབ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྗེས་སུ་རྟོགས་པའི་སེམས་ཉིད་དང་། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་། ལྡོག་པ་མེད་པའི་སེམས་ཉིད་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པའི་སེམས་ཉིད་དང་། འཁོར་བའི་རང་བཞིན་མཉམ་པའི་སེམས་ཉིད་དེ།
en: “What is the nature of this wondrous, extraordinary Dharma of the bodhisatva? He has love but perceives no self. He has compassion but perceives no sentient being. He has empathetic joy but perceives no life force. He has equanimity but perceives no person. His generosity is a giving mind. His morality is his peace of mind. His patience is the cessation of thought. His vigor is mental detachment. His meditation is a state of consideration. His wisdom is without elaboration. His application of mindfulness is without remembering and without mental activity. He has right exertion, with a mind free from arising and ceasing. He possesses the foundations of magical abilities, with a mind that does not engage in elaboration. He has faith, with a mind that is free from attachment. He is mindful, with a self-arisen mind. He is concentrated, with a mind that dwells in attainment. He possesses wisdom, with a mind that is free from faculties. He is powerful, with a faultless mind. He possesses the factors of awakening, the analyses of awakening. He cultivates the path, with a cultivated mind. He practices calm abiding meditation, with a calmed mind. He practices insight meditation, with superior vision. He cultivates the noble truths, with a mind filled with great knowledge. He brings sentient beings to maturity, and he is primordially pure. He receives the true Dharma, with a mind that is the indivisibility of the totality of phenomena. He patiently accepts the fact that phenomena have no origination, with a mind beyond apprehension. He has reached the stage of irreversibility, with an irreversible mind. He obtains the characteristics, with a mind free from essential characteristics. He adorns the seat of awakening, with a mind that rests on the seat of the three realms. He defeats Māra, with a mind that shows kindness to all sentient beings. He is awakened, as he has awoken to the inherent nature of all phenomena. He sets the wheel of the Dharma in motion, with a mind that cannot be stopped. He manifests his great final nirvāṇa, with a mind that has the same inherent nature as cyclic existence.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་རྗེས་སུ་རྟོགས་པ་དང་། རྟོགས་པའི་དོན་ལ་སྙོམས་པར་ཞུགས་པའི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ནི་འདི་དག་དང་གཞན་དག་སྟེ། དེའི་ཕྱིར་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་དང་ལྡན་པའི་སྐྱེས་བུ་དམ་པ་དེ་དག་དེ་འདྲ་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལ་བསམ་གཏན་ཞེས་བྱ་བ་ཅི་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཕྱིར་དེ་ལ་མ་ཆགས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་བདག་བདེ་བ་ལ་མ་ཆགས་པའི་ཕྱིར་རོ་མྱང་བ་མེད་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་ལ་དམིགས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་འདོད་པའི་ཁམས་ལ་མི་དམིགས་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་ལས་མི་ལྡོག་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་རབ་ཏུ་ཤེས་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་སྦྱོང་བའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་སེམས་ཀྱི་དབང་ཕྱུག་ཤེས་པའི་ཕྱིར་དེ་ཁོ་ན་ལ་འགྲོ་བའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་ཐམས་ཅད་ཀྱི་ཕྱིར་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཤེས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྙོམས་པར་འཇུག་པ་ཟིལ་གྱིས་གནོན་པའི་ཕྱིར་ཞི་བ་རབ་ཏུ་ཞི་བ་ཉེ་བར་ཞི་བའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་ཤིན་ཏུ་མཐར་ཕྱིན་པའི་ཕྱིར་མི་བསྐྱོད་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པའི་ཕྱིར་གཉེན་པོའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་འདས་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་མཆོག་གོ ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བར་བྱེད་པའི་ཕྱིར་སེམས་ཅན་ལ་བསམ་པ་སྔོན་དུ་འགྲོ་བའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ཟད་མི་ཤེས་པ་དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་འཆད་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་རྟག་ཏུ་མཉམ་པར་གཞག་པའི་ཕྱིར་མངོན་པར་འཕགས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་ལས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་དབང་བྱེད་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་ནི་ཡེ་ཤེས་ཆེ་བ་ཉིད་ཀྱི་ཕྱིར་ཁྱབ་པ་སྟེ། ཤཱ་རིའི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསམ་གཏན་ནོ། །
en: “What then, Śāriputra, do the meditative states consist of? The meditation states of bodhisatvas are not made up of any particular thing, because they are the fulfillment of the concentration of a tathāgata. Bodhisatvas do not relish their meditation, as they do not cling to their own happiness. The meditation of bodhisatvas is based on great compassion, as they have rid themselves of all vices. The meditation of bodhisatvas does not stray from concentration, as it does not grasp after the realm of sensual desire. The meditation of bodhisatvas is the preparation of their superior abilities, as they know the mental activity of all sentient beings. The meditation of bodhisatvas leaves fixed entities behind, as they have rid themselves of all vices. The meditation of bodhisatvas does not stray from concentration, as they know the supremacy of the mind. The meditation of bodhisatvas is the knowledge of all attainments, because it encompasses the whole of the form and formless realms. The meditation of bodhisatvas is calm, peaceful, and tranquil, as they have surpassed the attainments of śrāvakas and pratyekabuddhas. The meditation of bodhisatvas is unshakeable, because it is transcendent. The meditation of bodhisatvas is an enemy, as it destroys any connection to habitual tendencies. The meditation of bodhisatvas is supreme wisdom, as it has transcended all worlds. The meditation of bodhisatvas fosters the intentions of sentient beings, in order to rescue all sentient beings. The meditation of bodhisatvas is not cut off from the lineage of the Three Jewels, because of the unbreakable magical abilities of the tathāgatas. The meditation of bodhisatvas is supreme, as it is always composed. The meditation of bodhisatvas is controlled, as they have fully perfected all action. The meditation of bodhisatvas is omnipresent, as their knowledge is majestic.
